#+NAME: masas
|   | t(s) | dt(s) | m45(g) | m40(g) | m30(g) | m25(g) |  m0(g) | dm(g) |
|---+------+-------+--------+--------+--------+--------+--------+-------|
| ! |    t |    dt |    m45 |    m40 |    m30 |    m25 |     m0 |    dm |
| # |    0 |     1 | 1520.8 | 1494.7 | 1473.3 | 1457.4 | 1443.2 |   0.1 |
| # |   30 |     1 | 1519.2 | 1494.0 | 1472.9 | 1457.0 | 1442.9 |   0.1 |
| # |   60 |     1 | 1518.2 | 1493.3 | 1472.4 | 1456.5 | 1442.7 |   0.1 |
| # |   90 |     1 | 1517.3 | 1492.8 | 1471.9 | 1456.1 | 1442.4 |   0.1 |
| # |  120 |     1 | 1516.5 | 1492.1 | 1471.4 | 1455.6 | 1442.1 |   0.1 |
| # |  150 |     1 | 1515.5 | 1491.3 | 1470.9 | 1455.2 | 1441.8 |   0.1 |
| # |  180 |     1 | 1514.8 | 1490.7 | 1470.4 | 1454.7 | 1441.5 |   0.1 |
| # |  210 |     1 | 1513.9 | 1490.0 | 1469.9 | 1454.2 | 1441.2 |   0.1 |
| # |  240 |     1 | 1513.1 | 1489.4 | 1469.4 | 1453.8 | 1440.9 |   0.1 |
| # |  270 |     1 | 1512.2 | 1488.7 | 1468.9 | 1453.3 | 1440.5 |   0.1 |
| # |  300 |     1 | 1511.4 | 1488.1 | 1468.3 | 1452.8 | 1440.2 |   0.1 |
| # |  330 |     1 | 1510.6 | 1487.4 | 1467.9 | 1452.3 | 1439.9 |   0.1 |
| # |  360 |     1 | 1509.8 | 1486.7 | 1467.3 | 1451.9 | 1439.6 |   0.1 |
| # |  390 |     1 | 1509.0 | 1486.1 | 1466.8 | 1451.4 | 1439.3 |   0.1 |
| # |  420 |     1 | 1508.2 | 1485.4 | 1466.3 | 1451.0 | 1439.0 |   0.1 |
| # |  450 |     1 | 1507.4 | 1484.7 | 1465.8 | 1450.5 | 1438.7 |   0.1 |
| # |  480 |     1 | 1506.6 | 1484.1 | 1465.2 | 1450.0 | 1438.3 |   0.1 |
| # |  510 |     1 | 1505.8 | 1483.4 | 1464.7 | 1449.6 | 1438.0 |   0.1 |
| # |  540 |     1 | 1505.0 | 1482.7 | 1464.2 | 1449.1 | 1437.7 |   0.1 |
| # |  570 |     1 | 1504.2 | 1482.1 | 1463.7 | 1448.7 | 1437.4 |   0.1 |
| # |  600 |     1 | 1503.4 | 1481.4 | 1463.3 | 1448.2 | 1437.0 |   0.1 |
| # |  630 |     1 | 1502.6 | 1480.8 | 1462.7 | 1447.8 | 1436.7 |   0.1 |
| # |  660 |     1 | 1501.9 | 1480.1 | 1462.3 | 1447.3 | 1436.3 |   0.1 |
| # |  690 |     1 | 1501.1 | 1479.4 | 1461.7 | 1446.8 | 1436.0 |   0.1 |
| # |  720 |     1 | 1500.3 | 1478.8 | 1461.2 | 1446.4 | 1435.7 |   0.1 |
| # |  750 |     1 | 1499.5 | 1478.1 | 1460.7 | 1445.9 | 1435.4 |   0.1 |
| # |  780 |     1 | 1498.7 | 1477.5 | 1460.2 | 1445.4 | 1435.0 |   0.1 |
| # |  810 |     1 | 1497.9 | 1476.8 | 1459.7 | 1445.0 | 1434.7 |   0.1 |
| # |  840 |     1 | 1497.2 | 1476.2 | 1459.2 | 1444.5 | 1434.3 |   0.1 |
| # |  870 |     1 | 1496.4 | 1475.5 | 1458.7 | 1444.1 | 1434.0 |   0.1 |
| # |  900 |     1 | 1495.7 | 1474.9 | 1458.2 | 1443.6 | 1433.7 |   0.1 |
#+TBLFM: @4$2..@>$2=@-1+30 :: @3$3..@>$3=1 :: @3$9..@>$9=0.1

#+NAME: diagrama-termogravimetrico
|   | t(s) | dt(s) | mv45(g) | mv40(g) | mv30(g) | mv25(g) | mv0(g) | dm(g) | V45(V) | V40(V) | V30(V) | V25(V) | V0(V) | dV(V) | I45(A) | I40(A) | I30(A) | I25(A) | I0(A) | dI(A) |
|---+------+-------+---------+---------+---------+---------+--------+-------+--------+--------+--------+--------+-------+-------+--------+--------+--------+--------+-------+-------|
| ! |    t |    dt |     m45 |     m40 |     m30 |     m25 |     m0 |    dm |    V45 |    V40 |    V30 |    V25 |    V0 |    dV |    I45 |    I40 |    I30 |    I25 |    I0 |    dI |
| # |    0 |     1 |       0 |    26.1 |    47.5 |    63.4 |   77.6 |   0.2 |  5.971 |  5.334 |  3.977 |  3.388 |     0 |  1e-3 |   0.45 |   0.40 |   0.30 |   0.25 |     0 |  0.01 |
| # |   30 |     1 |     1.6 |    26.8 |    47.9 |    63.8 |   77.9 |   0.2 |  5.991 |  5.335 |  3.972 |  3.398 |     0 |  1e-3 |   0.45 |   0.40 |   0.30 |   0.25 |     0 |  0.01 |
| # |   60 |     1 |     2.6 |    27.5 |    48.4 |    64.3 |   78.1 |   0.2 |  5.998 |  5.332 |  3.959 |  3.403 |     0 |  1e-3 |   0.45 |   0.40 |   0.30 |   0.25 |     0 |  0.01 |
| # |   90 |     1 |     3.5 |    28.0 |    48.9 |    64.7 |   78.4 |   0.2 |  5.992 |  5.326 |  3.967 |  3.379 |     0 |  1e-3 |   0.46 |   0.40 |   0.30 |   0.25 |     0 |  0.01 |
| # |  120 |     1 |     4.3 |    28.7 |    49.4 |    65.2 |   78.7 |   0.2 |  6.006 |  5.325 |  3.980 |  3.401 |     0 |  1e-3 |   0.45 |   0.40 |   0.30 |   0.25 |     0 |  0.01 |
| # |  150 |     1 |     5.3 |    29.5 |    49.9 |    65.6 |   79.0 |   0.2 |  6.007 |  5.338 |  3.983 |  3.406 |     0 |  1e-3 |   0.46 |   0.40 |   0.30 |   0.25 |     0 |  0.01 |
| # |  180 |     1 |     6.0 |    30.1 |    50.4 |    66.1 |   79.3 |   0.2 |  6.015 |  5.333 |  3.972 |  3.395 |     0 |  1e-3 |   0.45 |   0.40 |   0.30 |   0.25 |     0 |  0.01 |
| # |  210 |     1 |     6.9 |    30.8 |    50.9 |    66.6 |   79.6 |   0.2 |  6.055 |  5.325 |  3.962 |  3.397 |     0 |  1e-3 |   0.46 |   0.40 |   0.30 |   0.25 |     0 |  0.01 |
| # |  240 |     1 |     7.7 |    31.4 |    51.4 |    67.0 |   79.9 |   0.2 |  6.048 |  5.341 |  3.971 |  3.407 |     0 |  1e-3 |   0.46 |   0.40 |   0.30 |   0.25 |     0 |  0.01 |
| # |  270 |     1 |     8.6 |    32.1 |    51.9 |    67.5 |   80.3 |   0.2 |  6.055 |  5.343 |  3.972 |  3.425 |     0 |  1e-3 |   0.46 |   0.40 |   0.30 |   0.25 |     0 |  0.01 |
| # |  300 |     1 |     9.4 |    32.7 |    52.5 |    68.0 |   80.6 |   0.2 |  6.031 |  5.329 |  3.976 |  3.423 |     0 |  1e-3 |   0.46 |   0.40 |   0.30 |   0.25 |     0 |  0.01 |
| # |  330 |     1 |    10.2 |    33.4 |    52.9 |    68.5 |   80.9 |   0.2 |  6.035 |  5.334 |  3.982 |  3.425 |     0 |  1e-3 |   0.46 |   0.40 |   0.30 |   0.25 |     0 |  0.01 |
| # |  360 |     1 |    11.0 |    34.1 |    53.5 |    68.9 |   81.2 |   0.2 |  6.042 |  5.318 |  3.995 |  3.423 |     0 |  1e-3 |   0.46 |   0.40 |   0.30 |   0.25 |     0 |  0.01 |
| # |  390 |     1 |    11.8 |    34.7 |    54.0 |    69.4 |   81.5 |   0.2 |  6.043 |  5.330 |  3.992 |  3.429 |     0 |  1e-3 |   0.46 |   0.41 |   0.30 |   0.25 |     0 |  0.01 |
| # |  420 |     1 |    12.6 |    35.4 |    54.5 |    69.8 |   81.8 |   0.2 |  6.052 |  5.342 |  3.975 |  3.415 |     0 |  1e-3 |   0.46 |   0.41 |   0.30 |   0.25 |     0 |  0.01 |
| # |  450 |     1 |    13.4 |    36.1 |    55.0 |    70.3 |   82.1 |   0.2 |  6.039 |  5.330 |  3.970 |  3.393 |     0 |  1e-3 |   0.46 |   0.41 |   0.30 |   0.25 |     0 |  0.01 |
| # |  480 |     1 |    14.2 |    36.7 |    55.6 |    70.8 |   82.5 |   0.2 |  6.043 |  5.365 |  3.972 |  3.398 |     0 |  1e-3 |   0.46 |   0.40 |   0.30 |   0.25 |     0 |  0.01 |
| # |  510 |     1 |    15.0 |    37.4 |    56.1 |    71.2 |   82.8 |   0.2 |  6.032 |  5.364 |  3.960 |  3.392 |     0 |  1e-3 |   0.46 |   0.41 |   0.30 |   0.25 |     0 |  0.01 |
| # |  540 |     1 |    15.8 |    38.1 |    56.6 |    71.7 |   83.1 |   0.2 |  6.024 |  5.345 |  3.980 |  3.384 |     0 |  1e-3 |   0.45 |   0.40 |   0.30 |   0.25 |     0 |  0.01 |
| # |  570 |     1 |    16.6 |    38.7 |    57.1 |    72.1 |   83.4 |   0.2 |  6.019 |  5.364 |  3.973 |  3.381 |     0 |  1e-3 |   0.46 |   0.41 |   0.30 |   0.25 |     0 |  0.01 |
| # |  600 |     1 |    17.4 |    39.4 |    57.5 |    72.6 |   83.8 |   0.2 |  6.028 |  5.355 |  3.983 |  3.388 |     0 |  1e-3 |   0.45 |   0.41 |   0.30 |   0.25 |     0 |  0.01 |
| # |  630 |     1 |    18.2 |    40.0 |    58.1 |    73.0 |   84.1 |   0.2 |  6.004 |  5.342 |  3.928 |  3.386 |     0 |  1e-3 |   0.45 |   0.41 |   0.30 |   0.25 |     0 |  0.01 |
| # |  660 |     1 |    18.9 |    40.7 |    58.5 |    73.5 |   84.5 |   0.2 |  6.024 |  5.349 |  3.959 |  3.383 |     0 |  1e-3 |   0.46 |   0.41 |   0.30 |   0.25 |     0 |  0.01 |
| # |  690 |     1 |    19.7 |    41.4 |    59.1 |    74.0 |   84.8 |   0.2 |  6.014 |  5.370 |  3.986 |  3.385 |     0 |  1e-3 |   0.46 |   0.41 |   0.30 |   0.25 |     0 |  0.01 |
| # |  720 |     1 |    20.5 |    42.0 |    59.6 |    74.4 |   85.1 |   0.2 |  6.026 |  5.364 |  3.979 |  3.383 |     0 |  1e-3 |   0.46 |   0.41 |   0.30 |   0.25 |     0 |  0.01 |
| # |  750 |     1 |    21.3 |    42.7 |    60.1 |    74.9 |   85.4 |   0.2 |  6.044 |  5.382 |  3.979 |  3.381 |     0 |  1e-3 |   0.46 |   0.41 |   0.30 |   0.25 |     0 |  0.01 |
| # |  780 |     1 |    22.1 |    43.3 |    60.6 |    75.4 |   85.8 |   0.2 |  6.043 |  5.386 |  3.979 |  3.359 |     0 |  1e-3 |   0.46 |   0.41 |   0.30 |   0.25 |     0 |  0.01 |
| # |  810 |     1 |    22.9 |    44.0 |    61.1 |    75.8 |   86.1 |   0.2 |  6.043 |  5.376 |  3.986 |  3.371 |     0 |  1e-3 |   0.46 |   0.41 |   0.30 |   0.25 |     0 |  0.01 |
| # |  840 |     1 |    23.6 |    44.6 |    61.6 |    76.3 |   86.5 |   0.2 |  6.053 |  5.342 |  3.972 |  3.374 |     0 |  1e-3 |   0.46 |   0.41 |   0.30 |   0.25 |     0 |  0.01 |
| # |  870 |     1 |    24.4 |    45.3 |    62.1 |    76.7 |   86.8 |   0.2 |  6.044 |  5.353 |  3.987 |  3.362 |     0 |  1e-3 |   0.46 |   0.40 |   0.30 |   0.25 |     0 |  0.01 |
| # |  900 |     1 |    25.1 |    45.9 |    62.6 |    77.2 |   87.1 |   0.2 |  6.032 |  5.365 |  3.983 |  3.358 |     0 |  1e-3 |   0.46 |   0.41 |   0.30 |   0.25 |     0 |  0.01 |
#+TBLFM: @4$2..@>$2=@-1+30 :: @3$3..@>$3=1 :: @3$9..@>$9=0.2 :: @3$15..@>$15=0.001 :: @3$21..@>$21=0.01

#+NAME: masa-tiempo
| y = 0.027072581 x + 1.0625    |
| y = 0.022052419 x + 26.128024 |
| y = 0.016938172 x + 47.3875   |
| y = 0.015387097 x + 63.356452 |
| y = 0.010680108 x + 77.410081 |
#+TBLFM: @1=fit(y=m*x+b,[y,x],[m,b],[remote(diagrama-termogravimetrico,@3$m45..@>$m45),remote(diagrama-termogravimetrico,@3$t..@>$t)]) :: @2=fit(y=m*x+b,[y,x],[m,b],[remote(diagrama-termogravimetrico,@3$m40..@>$m40),remote(diagrama-termogravimetrico,@3$t..@>$t)]) :: @3=fit(y=m*x+b,[y,x],[m,b],[remote(diagrama-termogravimetrico,@3$m30..@>$m30),remote(diagrama-termogravimetrico,@3$t..@>$t)]) :: @4=fit(y=m*x+b,[y,x],[m,b],[remote(diagrama-termogravimetrico,@3$m25..@>$m25),remote(diagrama-termogravimetrico,@3$t..@>$t)]) :: @5=fit(y=m*x+b,[y,x],[m,b],[remote(diagrama-termogravimetrico,@3$m0..@>$m0),remote(diagrama-termogravimetrico,@3$t..@>$t)])

#+NAME: entalpia-vaporizacion
|   |  m(g/s) | dm(g/s) | W(J/s) | dW(J/s) |
|---+---------+---------+--------+---------|
| ! |       m |      dm |      W |      dW |
| # | 0.02707 | 0.00017 |  -2.76 |    0.06 |
| # | 0.02205 | 0.00003 |  -2.16 |    0.05 |
| # | 0.01694 | 0.00003 |  -1.19 |    0.04 |
| # | 0.01539 | 0.00002 |  -0.85 |    0.03 |
| # | 0.01068 | 0.00005 |   0.00 |    0.00 |
#+TBLFM: @3$4=-vmean(remote(diagrama-termogravimetrico,@3$V45..@>$V45))*vmean(remote(diagrama-termogravimetrico,@3$I45..@>$I45));%.2f :: @4$4=-vmean(remote(diagrama-termogravimetrico,@3$V40..@>$V40))*vmean(remote(diagrama-termogravimetrico,@3$I40..@>$I40));%.2f :: @5$4=-vmean(remote(diagrama-termogravimetrico,@3$V30..@>$V30))*vmean(remote(diagrama-termogravimetrico,@3$I30..@>$I30));%.2f :: @6$4=-vmean(remote(diagrama-termogravimetrico,@3$V25..@>$V25))*vmean(remote(diagrama-termogravimetrico,@3$I25..@>$I25));%.2f :: @7$4=-vmean(remote(diagrama-termogravimetrico,@3$V0..@>$V0))*vmean(remote(diagrama-termogravimetrico,@3$I0..@>$I0));%.2f :: @3$5=vmean(remote(diagrama-termogravimetrico,@3$V45..@>$V45))*0.01+vmean(remote(diagrama-termogravimetrico,@3$I45..@>$I45))*0.001;%.2f :: @4$5=vmean(remote(diagrama-termogravimetrico,@3$V40..@>$V40))*0.01+vmean(remote(diagrama-termogravimetrico,@3$I40..@>$I40))*0.001;%.2f :: @5$5=vmean(remote(diagrama-termogravimetrico,@3$V30..@>$V30))*0.01+vmean(remote(diagrama-termogravimetrico,@3$I30..@>$I30))*0.001;%.2f :: @6$5=vmean(remote(diagrama-termogravimetrico,@3$V25..@>$V25))*0.01+vmean(remote(diagrama-termogravimetrico,@3$I25..@>$I25))*0.001;%.2f :: @7$5=vmean(remote(diagrama-termogravimetrico,@3$V0..@>$V0))*0.01+vmean(remote(diagrama-termogravimetrico,@3$I0..@>$I0))*0.001;%.2f

#+NAME: ajuste-entalpia
| y = 0.010387055 - 5.7751042e-3 x |
#+TBLFM: $1=fit(y=m*x+b,[y,x],[m,b],[remote(entalpia-vaporizacion,@3$m..@>$m),remote(entalpia-vaporizacion,@3$W..@>$W)])
